In [1]:
import pandas as pd

In [6]:
import numpy as np

In [8]:
import  os

In [18]:
path = 'C:\\Users\\reece\\InstaCart Basket Analysis 4.4.23\\Data\\'

In [10]:
path

'C:\\Users\\reece\\InstaCart Basket Analysis 4.4.23\\Data\\Original Data'

In [19]:
df_prods = pd.read_csv(os.path.join(path, 'Original Data', 'products.csv'), index_col=False)

In [24]:
df_ords = pd.read_csv(os.path.join(path, 'Prepared Data', 'orderswrangledv1.csv'), index_col=False)

In [25]:
df_ords.head()

,Unnamed: 0,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,prior,1,2,8,NaN
1,1,2398795,1,prior,2,3,7,15.0
2,2,473747,1,prior,3,3,12,21.0
3,3,2254736,1,prior,4,4,7,29.0
4,4,431534,1,prior,5,4,15,28.0

In [26]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [28]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,1.048575e+06,985475.000000
mean,5.242870e+05,1.710968e+06,3.156404e+04,1.717418e+01,2.778637e+00,1.345229e+01,11.102506
std,3.026977e+05,9.875774e+05,1.816695e+04,1.771094e+01,2.047751e+00,4.219144e+00,9.186663
min,0.000000e+00,6.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000
25%,2.621435e+05,8.554670e+05,1.589600e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000
50%,5.242870e+05,1.710657e+06,3.160800e+04,1.100000e+01,3.000000e+00,1.300000e+01,7.000000
75%,7.864305e+05,2.566970e+06,4.729700e+04,2.300000e+01,5.000000e+00,1.600000e+01,15.000000
max,1.048574e+06,3.421083e+06,6.310000e+04,1.000000e+02,6.000000e+00,2.300000e+01,30.000000

In [35]:
# create a dataframe

df_test = pd.DataFrame()

In [36]:
#create a mixed type column

df_test['mix']= ['a','b', 1, True]

In [37]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [38]:
#The function for checking whether a dataframe contains any mixed-type columns is as follows:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [40]:
#Note that this will convert a column’s data type from numeric to string, but there may be times where you need to go in the opposite direction, as well—from string to numeric.
#To change this, simply update the str within the astype() function to int64 or whichever numeric data type you want to use.


df_test['mix'] = df_test['mix'].astype('str')

In [41]:
#What this does is assign the function isnull() to the df_prods dataframe, then sum the result with the attached sum() function.
#The isnull() function is used to find missing observations, with “observations” here referring to entries in your dataframe


df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [43]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [44]:

df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [56]:
#If you choose to use the mean, you can use the df.describe() function to find the mean of the column in question, then use the following code to replace your missing values with it:

df['column with missings'].fillna(mean value, inplace=True)
If you choose to use the median, you can find it using the df_prods.median() function, then use the same command as above, only replacing “mean value” with “median value”:
df['column with missings'].fillna(median value, inplace=True)

NameError: name 'mean' is not defined

In [58]:
df_prods.shape

(49693, 5)

In [65]:
#a way to clean out the missing values, 

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

#another way you can drop all missing values is vai the following command: 
df_prods.dropna(inplace = True)

In [66]:
df_prods_clean.shape

(49677, 5)

In [73]:
#The following command will look for full duplicates within your dataframe:

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [68]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [70]:
df_prods_clean.shape

(49677, 5)

In [74]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [75]:
df_prods_clean_no_dups.shape

(49672, 5)